In [ ]:
### Series
- 값과 행렬로 구성된 1열 데이터
- 특성 하나의 데이터

In [2]:
import pandas as pd
import numpy as np

### Series 생성
- series는 list, tuple, ndarray로 생성할 수 있다.
- list, tuple인 경우에는 ndarray 로 생성한 다음 관리한다.
- ndarray인 경우에는 해당 행렬 데이터를 관리한다.

In [22]:
s1 = pd.Series([10, 20, 30, 40, 50])
print(s1)
display(s1)

0    10
1    20
2    30
3    40
4    50
dtype: int64

0    10
1    20
2    30
3    40
4    50
dtype: int64

### Series가 관리하는 데이터에 접근하기
- value
- index

In [ ]:
print(s1[0])
print(s1[1])
print(s1[2])
#  **[]는 인덱스 지칭하는 것.**

In [23]:
# 관리하는 값들은 모두 가져온다.
array1 = s1.values
display(type(array1))
print(array1)

numpy.ndarray

[10 20 30 40 50]

In [24]:
# index를 추출한다.
array2 = s1.index
print(type(array2))
print(array2)
print(list(array2))

# 활용 ex)  나이 컬럼 >= 30, index 삭제.
# 조건식으로 추출

<class 'pandas.core.indexes.range.RangeIndex'>
RangeIndex(start=0, stop=5, step=1)
[0, 1, 2, 3, 4]

### index 지정하기
- Series 생성시 index를 지정하지 않으면 0부터 1씩 증가되는 값으로 지정된다.
- index를 지정하고 싶다면 생성시 지정하거나 생성 후 필요할 때 지정할 수 있다.

In [3]:
s1 = pd.Series([1000, 2000, 3000])
s1

0    1000
1    2000
2    3000
dtype: int64

In [4]:
# 생성한 Series에 인덱스를 변경
# 새롭게 설정하는 인덱스의 개수는 Series의 전체 행의 개수와 일치해야 한다.
s1.index = ['값1', '값2', '값3']
s1

값1    1000
값2    2000
값3    3000
dtype: int64

In [6]:
# 생성할 때 index를 지정한다.
s2 = pd.Series([1000, 2000, 3000], index=['값1', '값2', '값3'])
s2

값1    1000
값2    2000
값3    3000
dtype: int64

### 값을 가져온다

In [7]:
s1 = pd.Series([10,20,30,40,50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [8]:
# index가 숫자로 되어 있을 경우 숫자를 지정하면 수너가 아닌 index 값을 통해 접근한다.
print(s1[0])
print(s1[1])
print(s1[2])

10
20
30

In [9]:
s2 = pd.Series([10, 20, 30, 40, 50], index=[3,0,4,1,2])
s2

3    10
0    20
4    30
1    40
2    50
dtype: int64

In [11]:
# index를 지정하더라도 숫자로 구성되어 이으면 []의 숫자는 순서가 아닌 index 값을 의미한다.
print(s2[0])
print(s2[1])
print(s2[2])

20
40
50

In [14]:
# 인덱스가 문자열인 series
a1 = ['값1','값2', '값3','값4','값5']
s3 = pd.Series([10,20,30,40,50], index=a1)
s3

값1    10
값2    20
값3    30
값4    40
값5    50
dtype: int64

In [15]:
print(s3['값1'])
print(s3['값2'])
print(s3['값3'])

10
20
30

In [16]:
# index가 숫자가 아닌 Series에 숫자를 통해 접근을 하게 되면 순서에 해당한다.
# 0부터 1씩 증가
print(s3[0])
print(s3[1])
print(s3[2])

10
20
30

### Series의 연산
- Series는 내부적으로 1차원 ndarray를 관리하기 때문에 연산 등의 작업은 ndarray와 동일하다.

In [18]:
s1 = pd.Series([10,20,30,40,50])
s2 = pd.Series([1,2,3,4,5,6])

In [21]:
# Series와 Series의 연산
# 각 Series의 데이터를 1:1 매칭하여 연산을 한다.
# 개수가 다르면 NaN 값을 결과값으로 설정한다.
# NaN: Not a Number. 결측치를 의미하는 값
# 결측치: 측정되지 않는 값. 값이 비어있는 공간.
s10 = s1 + s2
s11 = s1 - s2
s12 = s1 * s2
s13 = s1 // s2

print(s10)
print(s11)
print(s12)
print(s13)

0    11.0
1    22.0
2    33.0
3    44.0
4    55.0
5     NaN
dtype: float64
0     9.0
1    18.0
2    27.0
3    36.0
4    45.0
5     NaN
dtype: float64
0     10.0
1     40.0
2     90.0
3    160.0
4    250.0
5      NaN
dtype: float64
0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
5     NaN
dtype: float64

In [25]:
# Series와 특정 값의 계산
s20 = s1 + 10
s21 = s1 - 10
s22 = s1 * 10
s23 = s1 // 10

print(s20)
print(s21)
print(s22)
print(s23)

0    20
1    30
2    40
3    50
4    60
dtype: int64
0     0
1    10
2    20
3    30
4    40
dtype: int64
0    100
1    200
2    300
3    400
4    500
dtype: int64
0    1
1    2
2    3
3    4
4    5
dtype: int64

In [26]:
r1 = s1 > 30
r1

0    False
1    False
2    False
3     True
4     True
dtype: bool

### 슬라이싱

In [27]:
s1 = pd.Series([10, 20, 30, 40, 50], index = ['a1', 'a2', 'a3', 'a4', 'a5'])
s1

a1    10
a2    20
a3    30
a4    40
a5    50
dtype: int64

In [28]:
# a2 ~ a4 까지
s2 = s1['a2' : 'a4']
s2

a2    20
a3    30
a4    40
dtype: int64

In [31]:
# 순서 1 ~ 4-1 까지
s2 = s1[1:4]
s2

a2    20
a3    30
a4    40
dtype: int64

In [32]:
# a1, a3, a5만 가져온다
# 원하는 것만 골라서 가져온다.
s4 = s1[['a1','a3','a5']]
s4

a1    10
a3    30
a5    50
dtype: int64

In [36]:
# 순서 인덱스
# 0, 2, 4
s4 = s1 [[0, 2, 4]]
s4

a1    10
a3    30
a5    50
dtype: int64

In [37]:
# True나 False를 넣으면 True 자리에 해당하는 것만 추출한다.
# 단 데이터의 개수와 일치해야 한다.
s6 = s1[[True, False, True, False, True]]
s6

a1    10
a3    30
a5    50
dtype: int64

In [38]:
# 조건에 따라 가져온다.
s7 = s1 > 30
s7

a1    False
a2    False
a3    False
a4     True
a5     True
dtype: bool

In [39]:
s8 = s1[s7]
s8

a4    40
a5    50
dtype: int64

In [40]:
s9 = s1[s1 > 30]
s9

a4    40
a5    50
dtype: int64

In [45]:
# <csv파일>
# 데이터를 쉼표(,)로 구분한 데이터 양식

# <데이터 프레임 생성시 encoding 오류가 발생하거나 생성된 데이터프레임의 한글데이터가 깨질 경우>
# pandas는 기본 인코딩이 utf-8로 설정되어 있다. 허나 한국에서 엑셀을 통해 작업한 csv 파일은 인코딩이 euc-kr로 되어있다.
# csv 파일을 통해 생성시 encoding 오류가 나거나 한글이 깨져서 나오면 encoding을 euc-kr로 설정해서 시도해본다.

# 첫 번째 줄 데이터가 컬럼의 이름으로 결정된다.
df1 = pd.read_csv('data/grade.csv', encoding='euc-kr')
df1

   이름  학년  성별   국어    영어    수학    과학
0  철수   1  남자   98   NaN  88.0  64.0
1  영희   2  여자   88  90.0  62.0  72.0
2  민수   1  남자   92  70.0   NaN   NaN
3  수현   3  여자   63  60.0  31.0  70.0
4  호영   4  남자  120  50.0   NaN  88.0

In [46]:
# 만약 첫 번째 줄부터 데이터로 되어 있다면
df2 = pd.read_csv('data/grade.csv', header=None, encoding='euc-kr')
df.columns = ['a1','a2','a3','a4','a5','a6','a7']
df2

    0   1   2    3    4    5    6
0  이름  학년  성별   국어   영어   수학   과학
1  철수   1  남자   98  NaN   88   64
2  영희   2  여자   88   90   62   72
3  민수   1  남자   92   70  NaN  NaN
4  수현   3  여자   63   60   31   70
5  호영   4  남자  120   50  NaN   88

In [49]:
# 만약 3번째 줄의 데이터를 컬럼 이름으로 사용하겠다면
# 단, 컬럼이름으로 지정된 row 위에 있는 데이터는 사라진다. 
df3 = pd.read_csv('data/grade.csv', encoding='euc-kr', header= 2)
df3

   영희  2  여자   88  90    62    72
0  민수  1  남자   92  70   NaN   NaN
1  수현  3  여자   63  60  31.0  70.0
2  호영  4  남자  120  50   NaN  88.0

In [59]:
# 엑셀 파일을 통한 데이터 프레임 생성
# sheet_name : 문자열을 넣을 경우 sheet의 이름이 되고 숫자를 넣을 경우
# sheet의 순서(0 부터 시작)을 의미한다.
# 생략시 첫 번째 시트로 설정된다.


# df1 = pd.read_excel('data/grade.xlsx')
# df1 = pd.read_excel('data/grade.xlsx', sheet_name=0)
df1 = pd.read_excel('data/grade.xlsx', sheet_name='grade')
df1

   이름  학년  성별   국어    영어    수학    과학
0  철수   1  남자   98   NaN  88.0  64.0
1  영희   2  여자   88  90.0  62.0  72.0
2  민수   1  남자   92  70.0   NaN   NaN
3  수현   3  여자   63  60.0  31.0  70.0
4  호영   4  남자  120  50.0   NaN  88.0